old_projects/cylinders/cylinder_Bernulli/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
 inlet
 	{
 	   type fixedValue;
 	   value uniform (1 0 0);
 	}
 outlet
 	{
 	   type zeroGradient;
 	}
 bottom
 	{
 	   type zeroGradient;
 	}
 top
 	{
 	   type zeroGradient;
 	}
 cylinder
 	{
 	   type rotatingWallVelocity;
	   origin (0 0 0);
	   axis (0 0 1);
	   omega -5.0;
 	}
 defaultFaces
 	{
 	    type empty;
 	}
}

// ************************************************************************* //
