old_projects/cylinders/cylinder_Bernulli/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          198;
        startFace       142428;
    }
    outlet
    {
        type            patch;
        nFaces          198;
        startFace       142626;
    }
    bottom
    {
        type            patch;
        nFaces          330;
        startFace       142824;
    }
    top
    {
        type            patch;
        nFaces          330;
        startFace       143154;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          264;
        startFace       143484;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          143088;
        startFace       143748;
    }
)

// ************************************************************************* //
